src/МенеджерЗаданий/DataProcessors/мрПолучениеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мрПолучениеДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБлоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/МенеджерЗаданий/InformationRegisters/мрДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мрДанные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Город</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товар</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/МенеджерЗаданий/DataProcessors/мрПолучениеДанных/Ext/ObjectModule.bsl
Перем Данные;
Перем СчетчикБлоков;

#Область ПрограммныйИнтерфейс

Функция ПолучитьСледующийБлокДанных(ВыходныеДанные) Экспорт
	
	Если СчетчикБлоков >= КоличествоБлоков Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РазмерШага = (ДатаОкончания - ДатаНачала) / КоличествоБлоков;
	
	ДатаН = ДатаНачала + СчетчикБлоков * РазмерШага;
	СчетчикБлоков = СчетчикБлоков + 1;
	ДатаК = ДатаНачала + СчетчикБлоков * РазмерШага;
	
	Если КоличествоБлоков = СчетчикБлоков Тогда
		ДатаК = ДатаОкончания;
	КонецЕсли;
	
	Выборка = ПолучитьДанныеИзБазы(ДатаН, ДатаК);
	ВыходныеДанные = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("Регистратор");
		Структура.Вставить("Период");
		Структура.Вставить("Город");
		Структура.Вставить("Товар");
		Структура.Вставить("Количество");
		Структура.Вставить("Цена");
		Структура.Вставить("Сумма");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		ВыходныеДанные.Добавить(Структура);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ИмяМетодаMAP() Экспорт 
	Возврат "MapReduce.Map";
КонецФункции

Функция ИмяМетодаShuffle() Экспорт 
	Возврат "MapReduce.Shuffle";
КонецФункции

Функция ИмяМетодаReduce() Экспорт 
	Возврат "MapReduce.Reduce";
КонецФункции


#КонецОбласти

#Область Служебные

Функция ПолучитьДанныеИзБазы(ДатаН, ДатаК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мрДанные.Регистратор КАК Регистратор,
	|	мрДанные.Период КАК Период,
	|	мрДанные.Город КАК Город,
	|	мрДанные.Товар КАК Товар,
	|	мрДанные.Количество КАК Количество,
	|	мрДанные.Цена КАК Цена,
	|	мрДанные.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.мрДанные КАК мрДанные
	|ГДЕ
	|	мрДанные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаН);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаК);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выбрать();
		
КонецФункции

#КонецОбласти

СчетчикБлоков = 0;
